__author__ = 'ruanchangming'
'''
采用循环和list来更好的支持多红包
'''
import time ,easygui,datetime

timeAndWord=[["2015-11-4 9:28:00",'博洋双11只要主义真'],["1800",'赛诺低至19元秒杀'],
             ["1800",'吉利鸟沙发垫'],["1800",'暖爆了'],
             ["1800",'分分钟免单赠纯金吊坠'],["1800",'多喜爱双11狂欢购'],
             ["1800",'中国美堂皇绣'],["3600",'抢诺伊曼记忆枕'],
             ["1800",'就爱富安娜'],["1800",'真蚕丝一被子'],
             ["3600",'富光旗舰店'],["1800",'来苏娜抢79元四件套'],
             ["1800",'金号毛巾1元起'],["1800",'梦洁'],
             ["1800",'茧缘蚕丝被供全球'],["1800",'回家继续吧']]

timeNow=datetime.datetime.now()
targetTime=datetime.datetime.strptime("2015-12-13 9:58:00","%Y-%m-%d %H:%M:%S")
for n in timeAndWord:
    if n[1]


